Котельников_АБ_70153995/src/Documents/ЗатратыНаВакансию/ЗатратыНаВакансию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗатратыНаВакансию</name>
  <registerRecords>AccumulationRegister.ЗатратыНаВакансии</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтоимостьРазмещения</name>
    <attributes>
      <name>ДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сайт</name>
      <type>
        <types>CatalogRef.ИсточникиПривлечения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифныйПлан</name>
      <type>
        <types>CatalogRef.ТарифныеПланы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/AccumulationRegisters/ЗатратыНаВакансии/ЗатратыНаВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗатратыНаВакансии</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Сайт</name>
    <type>
      <types>CatalogRef.ИсточникиПривлечения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифныйПлан</name>
    <type>
      <types>CatalogRef.ТарифныеПланы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Котельников_АБ_70153995/src/Documents/ЗатратыНаВакансию/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ЗатратыНаВакансии 
	Движения.ЗатратыНаВакансии.Записывать = Истина;
	Для Каждого ТекСтрокаСтоимостьРазмещения Из СтоимостьРазмещения Цикл
		Движение = Движения.ЗатратыНаВакансии.Добавить();
		Движение.Период = Дата;
		Движение.Вакансия = Вакансия;
		Движение.ДатаОплаты = ТекСтрокаСтоимостьРазмещения.ДатаОплаты;
		Движение.Сайт = ТекСтрокаСтоимостьРазмещения.Сайт;
		Движение.ТарифныйПлан = ТекСтрокаСтоимостьРазмещения.ТарифныйПлан;
		Движение.Цена = ТекСтрокаСтоимостьРазмещения.Цена;
	КонецЦикла;

КонецПроцедуры
